export const RES_ERRORS = {
	SERVER_500: 'На сервере произошла ошибка',

	REGISTRATION_409: 'Пользователь с таким email уже существует',
	REGISTRATION_DEFAULT: 'Переданы некорректные данные',

	AUTHORIZATION_DEFAULT: 'Вы ввели неправильный email или пароль.',

	UPDATE_PROFILE: 'Пользователь с таким email уже существует',
	UPDATE_DEFAULT_400: 'При обновлении профиля произошла ошибка',
	UPDATE_SUCCESS: 'Данные успешно обновлены!',
};

export const ERRORS = {
	NOT_FOUND: 'Результаты не найдены',
	SEARCH_ERROR: 'Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз',
};
